In [ ]:
# coding: utf-8

In [ ]:
"""
②簡単にデータの状態を確認する。
(行数列数カウント・データの選択的表示・重複の有無など)
"""

In [ ]:
"""
まとめ
df.shape #行数・列数の取得
df.index #行数の取得
df.columns #列情報・列#のリストの取得
df.dtypes #各列のデータ型(object/int/floatなど)を取得
df.loc[] #行を指定してデータを表示
df.iloc[[], []] #行・列を指定してデータを取得(数字指定) 
df[条件式]　#条件式を入れてデータを抽出
df.query() #複数条件式を入れてデータを抽出
df.unique() #重複なしであるデータをならべる。リストとして返す
df.drop_duplicates() #重複のあるデータを除去
df.describe() #要約統計量
"""

In [4]:
# パンダインポート
import pandas as pd

In [5]:
# データインポート
df = pd.read_csv('./lunch_box_2.csv')

In [6]:
#data frameの行数・列数の確認　0行目は数えていない。1列目は数えている
print('data frameの行数・列数の確認==>\n', df.shape) #df.shape

data frameの行数・列数の確認==>
 (207, 12)

In [7]:
#indexの確認 (データの行数？　0からはじまって207番まで)
print('indexの確認==>\n', df.index) #df.index

indexの確認==>
 RangeIndex(start=0, stop=207, step=1)

In [8]:
# columnの確認 (1行目を抽出してリストとして返す。)
print('columnの確認==>\n', df.columns) #df.columns

columnの確認==>
 Index(['datetime', 'y', 'week', 'soldout', 'name', 'kcal', 'remarks', 'event',
       'payday', 'weather', 'precipitation', 'temperature'],
      dtype='object')

In [9]:
df.columns

Index(['datetime', 'y', 'week', 'soldout', 'name', 'kcal', 'remarks', 'event',
       'payday', 'weather', 'precipitation', 'temperature'],
      dtype='object')

In [10]:
# dataframeの各列のデータ型を確認
print('dataframeの各列のデータ型を確認==>\n', df.dtypes)

dataframeの各列のデータ型を確認==>
 datetime          object
y                  int64
week              object
soldout            int64
name              object
kcal             float64
remarks           object
event             object
payday           float64
weather           object
precipitation     object
temperature      float64
dtype: object

In [12]:
#Columns名を指定して任意の列だけ取り出し
df[['name', 'kcal']].head()

         name  kcal
0    厚切りイカフライ   NaN
1     手作りヒレカツ   NaN
2  白身魚唐揚げ野菜あん   NaN
3      若鶏ピリ辛焼   NaN
4    ビッグメンチカツ   NaN

In [13]:
# 100行目から105行目まで表示したい場合
df[100:106]

,datetime,y,week,soldout,name,kcal,remarks,event,payday,weather,precipitation,temperature
100,2014/4/22,78,火,1,マーボ豆腐,382.0,NaN,NaN,NaN,曇,--,18.8
101,2014/4/23,63,水,0,手作りひれかつ,340.0,NaN,NaN,NaN,快晴,--,19.4
102,2014/4/24,56,木,1,鶏の照り焼きマヨ,360.0,NaN,NaN,NaN,晴れ,--,19.9
103,2014/4/25,80,金,0,中華丼,NaN,お楽しみメニュー,NaN,NaN,晴れ,--,20.8
104,2014/4/28,54,月,0,タンドリーチキン,342.0,NaN,NaN,NaN,晴れ,--,22.7
105,2014/4/30,97,水,1,豚味噌メンチカツ,368.0,NaN,NaN,NaN,雨,0.5,17.5

In [34]:
# indexが100の行だけ取得したい場合
df.loc[100]
df.loc[100:102]

,datetime,y,week,soldout,name,kcal,remarks,event,payday,weather,precipitation,temperature
100,2014/4/22,78,火,1,マーボ豆腐,382.0,NaN,NaN,NaN,曇,--,18.8
101,2014/4/23,63,水,0,手作りひれかつ,340.0,NaN,NaN,NaN,快晴,--,19.4
102,2014/4/24,56,木,1,鶏の照り焼きマヨ,360.0,NaN,NaN,NaN,晴れ,--,19.9

In [15]:
# もっとピンポイントに抽出
# 例　1,2,4行目と0-2列目を取得
df.iloc[[1,2,4],[0,2]]

     datetime week
1  2013/11/19    火
2  2013/11/20    水
4  2013/11/22    金

In [22]:
df[['kcal','y']].head()

   kcal    y
0   NaN   90
1   NaN  101
2   NaN  118
3   NaN  120
4   NaN  130

In [23]:
# 条件を指定して抽出
df[df['kcal'] > 450]

,datetime,y,week,soldout,name,kcal,remarks,event,payday,weather,precipitation,temperature
29,2014/1/8,128,水,0,豚肉の生姜焼,462.0,NaN,NaN,NaN,曇,--,9.8
45,2014/1/31,92,金,1,メダイ照り焼,460.0,NaN,NaN,NaN,快晴,--,14.1
193,2014/9/9,63,火,0,ハンバーグデミソース,460.0,NaN,NaN,NaN,晴れ,--,26.8

In [25]:
# queryメソッドを使うと、複数条件の指定で、特定カラムだけ抽出
# query内のシングル/ダブルクオーテーションの使い方に注意
df[['name', 'kcal']].query('kcal > 450 and name == "豚肉の生姜焼"')

      name   kcal
29  豚肉の生姜焼  462.0

In [29]:
# 'remarks'にはたとえばどんなデータが入ってるか確認
df['remarks'].unique()

array([nan, '鶏のレモンペッパー焼（50食）、カレー（42食）', '酢豚（28食）、カレー（85食）', 'お楽しみメニュー',
       '料理長のこだわりメニュー', '手作りの味', 'スペシャルメニュー（800円）'], dtype=object)

In [31]:
# datatime単位で重複したデータが存在しないか確認
# dfの長さと列名で指定したデータの長さを比較している
print(len(df) == len(df['datetime'].unique()))　#重複なし→True
print(len(df) == len(df['kcal'].unique())) #重複あり→False

True
False

In [32]:
#行方向で重複行を削除
df.drop_duplicates()
print(df.shape) #重複が存在しないので数は変わらないはず
#dfでdf[]やdf[[]]行や列を指定できる？？

(207, 12)

In [33]:
# 要約統計量の表示
# dtypeがintかfloatのみ表示
df.describe()

                y     soldout        kcal  payday  temperature
count  207.000000  207.000000  166.000000    10.0   207.000000
mean    86.623188    0.449275  404.409639     1.0    19.252174
std     32.882448    0.498626   29.884641     0.0     8.611365
min     29.000000    0.000000  315.000000     1.0     1.200000
25%     57.000000    0.000000  386.000000     1.0    11.550000
50%     78.000000    0.000000  408.500000     1.0    19.800000
75%    113.000000    1.000000  426.000000     1.0    26.100000
max    171.000000    1.000000  462.000000     1.0    34.600000